<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom">
  <channel>
    <title>Php on Lemon Cake</title>
    <link>lemon-cake.github.io/tags/php/</link>
    <description>Recent content in Php on Lemon Cake</description>
    <generator>Hugo -- gohugo.io</generator>
    <language>fr-fr</language>
    <lastBuildDate>Wed, 15 Feb 2017 12:30:00 +0000</lastBuildDate>
    
	<atom:link href="lemon-cake.github.io/tags/php/index.xml" rel="self" type="application/rss+xml" />
    
    
    <item>
      <title>Sécuriser et cacher l&#39;accès à phpMyAdmin sur votre serveur</title>
      <link>lemon-cake.github.io/post/securiser-et-cacher-l-acces-a-phpmyadmin-sur-votre-serveur/</link>
      <pubDate>Wed, 15 Feb 2017 12:30:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/securiser-et-cacher-l-acces-a-phpmyadmin-sur-votre-serveur/</guid>
      <description>Après l&amp;rsquo;installation de votre serveur web sous Linux, vous allez sans doute vouloir gérer vos bases de données via phpMyAdmin. Mais par défaut, après son installation il est important de sécuriser un minium et cacher l&amp;rsquo;accès à phpMyAdmin.
Commençons par supprimer le dossier setup qui permet la configuration de base
rm -rf /usr/share/phpmyadmin/setup  Puis, afin d&amp;rsquo;éviter que l&amp;rsquo;accès à phpMyAdmin soit dispo sur l&amp;rsquo;ensemble de vos VirtualHost, il faut supprimer l&amp;rsquo;alias qui dans le fichier /etc/phpmyadmin/apache.</description>
    </item>
    
    <item>
      <title>Créer une tâche CRON sous Symfony</title>
      <link>lemon-cake.github.io/post/creer-une-tache-cron-sous-symfony/</link>
      <pubDate>Tue, 10 Jan 2017 12:30:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/creer-une-tache-cron-sous-symfony/</guid>
      <description>Je me suis enfin plongé dans Symfony pour des besoins professionnels et j&amp;rsquo;ai été confronté au fait de devoir exécuter une tâche CRON sur un site Symfony. Alors oui créer un CRON n&amp;rsquo;est pas dur mais pouvoir réutiliser la logique et surtout la puissance de Symfony n&amp;rsquo;est pas forcément facile à faire si on doit charger composants après composants.
Il y a toujours la possibilité de créer des routes et d&amp;rsquo;appeler les URL dans le CRON mais comme Symfony intègre une console, pourquoi ne pas s&amp;rsquo;en servir justement.</description>
    </item>
    
    <item>
      <title>Créer un système de connexion &#34;Se souvenir de moi&#34;</title>
      <link>lemon-cake.github.io/post/creer-un-systeme-de-connexion-se-souvenir-de-moi/</link>
      <pubDate>Fri, 23 Sep 2016 12:30:01 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/creer-un-systeme-de-connexion-se-souvenir-de-moi/</guid>
      <description>Dans mon billet précédent, Crypter et décrypter une chaîne de caractères en PHP, je vous expliquais comment crypter une chaine de caractère. Voici un cas concret de son utilisation
Avant-propos J&amp;rsquo;ai un site Internet où dessus mes utilisateurs peuvent s&amp;rsquo;inscrire afin de faire diverses actions. Et j&amp;rsquo;aimerai que lors de la connexion, mes utilisateurs, puissent cocher la case &amp;ldquo;Se souvenir de moi&amp;rdquo; afin de ne pas devoir en permanence se reconnecter.</description>
    </item>
    
    <item>
      <title>Crypter et décrypter une chaîne de caractères en PHP</title>
      <link>lemon-cake.github.io/post/crypter-et-decrypter-une-chaine-de-caracteres-en-php/</link>
      <pubDate>Fri, 23 Sep 2016 12:30:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/crypter-et-decrypter-une-chaine-de-caracteres-en-php/</guid>
      <description>Dans certains programmes il peut être intéressant de vouloir stocker une chaîne de caractère crypté et pouvoir la décrypter quand bon vous semble. Voici comment faire en PHP pour passer d&amp;rsquo;une chaîne de caractère compréhensible à quelque chose d&amp;rsquo;incompréhensible.
Avant-propos Avant toute chose, il est préférable de bien distinguer la différence entre cryptage (double sens) et authentification (sens unique).
Différence entre le cryptage et l&amp;rsquo;authentification Le cryptage permet de modifier un message, afin qu&amp;rsquo;il ne peut être décrypté que si l&amp;rsquo;on obtient la bonne clé.</description>
    </item>
    
    <item>
      <title>Récupérer le fil d&#39;actualité d&#39;une page Facebook facilement</title>
      <link>lemon-cake.github.io/post/recuperer-fil-dactualite-dune-page-facebook-facilement/</link>
      <pubDate>Thu, 26 May 2016 12:30:03 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/recuperer-fil-dactualite-dune-page-facebook-facilement/</guid>
      <description>&lt;p&gt;Si vous connaissez l&amp;rsquo;API de Facebook, vous savez à quel point celle-ci est très complexe à utiliser.
Aujourd&amp;rsquo;hui je vous propose de récupérer le contenu des actualités qui ont été postés sur une page Facebook (dont vous êtes ou non le propriétaire).&lt;/p&gt;

&lt;p&gt;&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Fusionner des images avec PHP (avec un canal alpha)</title>
      <link>lemon-cake.github.io/post/fusionner-des-images-avec-php-avec-un-canal-alpha/</link>
      <pubDate>Sat, 23 Aug 2014 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/fusionner-des-images-avec-php-avec-un-canal-alpha/</guid>
      <description>&lt;p&gt;Il y a quelques temps j&amp;#39;ai fais&amp;nbsp;un site Internet pour un photographe et il voulait int&amp;eacute;grer son logo sur chacune des photos lors de l&amp;#39;upload.&amp;nbsp;Avec un petit tour sur le doc PHP, la librairie GD permet de faire cela tr&amp;egrave;s facilement gr&amp;acirc;ce &amp;agrave; &lt;a href=&#34;http://php.net//manual/fr/function.imagecopy.php&#34; target=&#34;_blank&#34;&gt;imagecopy&lt;/a&gt;.&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Payez en ligne simplement avec Stripe</title>
      <link>lemon-cake.github.io/post/payez-en-ligne-simplement-avec-stripe/</link>
      <pubDate>Thu, 21 Aug 2014 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/payez-en-ligne-simplement-avec-stripe/</guid>
      <description>&lt;p&gt;La derni&amp;egrave;re fois que j&amp;#39;ai programm&amp;eacute; un site de vente en ligne, j&amp;#39;ai d&amp;ucirc; utiliser Paypal car le client ne voulait pas utiliser le syst&amp;egrave;me de sa banque. Vous allez dire que c&amp;#39;est cool car l&amp;#39;API de Paypal est simple. Le seul souci&amp;nbsp;c&amp;#39;est que pour payer on est forc&amp;eacute;ment redirig&amp;eacute; vers leur site Internet.&amp;nbsp;Et bien gr&amp;acirc;ce &amp;agrave;&amp;nbsp;&lt;a href=&#34;https://stripe.com/fr&#34; target=&#34;_blank&#34;&gt;Stripe&lt;/a&gt;&amp;nbsp;vous pourrez cr&amp;eacute;er votre propre page de paiement avec vos petits doigts.&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Convertir les styles CSS en attribut style des balises HTML</title>
      <link>lemon-cake.github.io/post/convertir-les-styles-css-en-attribut-style-des-balises-html/</link>
      <pubDate>Wed, 28 May 2014 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/convertir-les-styles-css-en-attribut-style-des-balises-html/</guid>
      <description></description>
    </item>
    
    <item>
      <title>Générer des mots de passe aléatoire</title>
      <link>lemon-cake.github.io/post/generer-des-mots-de-passe-aleatoire/</link>
      <pubDate>Wed, 16 Apr 2014 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/generer-des-mots-de-passe-aleatoire/</guid>
      <description>&lt;p&gt;Sur mes sites Internet, quand un utilisateur se cr&amp;eacute; un compte, ou s&amp;#39;il perd son mot de passe, je dois lui en renvoyer un. Mais comme ne je suis pas non plus idiot, je le g&amp;eacute;n&amp;egrave;re automatiquement en PHP ou JavaScript, en fonction du contexte. Voici comment les g&amp;eacute;n&amp;eacute;rer&lt;/p&gt;


&lt;p&gt;La g&amp;eacute;n&amp;eacute;ration des mots de passes est une chose tr&amp;egrave;s simple, mais plut&amp;ocirc;t que de s&amp;#39;emb&amp;eacute;ter &amp;agrave; programmer le truc, voici 2 fonctions pour le faire.&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Créer des événements récurrents en PHP</title>
      <link>lemon-cake.github.io/post/creer-des-evenements-recurrents-en-php/</link>
      <pubDate>Thu, 27 Mar 2014 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/creer-des-evenements-recurrents-en-php/</guid>
      <description></description>
    </item>
    
    <item>
      <title>Les fonctions de PHP en JavaScript</title>
      <link>lemon-cake.github.io/post/les-fonctions-de-php-en-javascript/</link>
      <pubDate>Mon, 24 Mar 2014 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/les-fonctions-de-php-en-javascript/</guid>
      <description></description>
    </item>
    
    <item>
      <title>Créer une barre de progression incrémentable</title>
      <link>lemon-cake.github.io/post/creer-une-barre-de-progression-incrementable/</link>
      <pubDate>Tue, 25 Feb 2014 12:31:17 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/creer-une-barre-de-progression-incrementable/</guid>
      <description>&lt;p&gt;Lorsque vous faites vos scripts avec des requêtes en AJAX, vous avez sans doute dû être confronté au problème &amp;ldquo;Mais où en est mon script ?&amp;rdquo;. Et bien voici un petit tutorial simple pour vous apprendre à créer une barre de progression incrémentable très facilement.&lt;/p&gt;

&lt;div class=&#34;read-more&#34;&gt;&lt;/div&gt;

&lt;p&gt;Lors de ce tutorial nous allons créer 2 scripts PHP, l&amp;rsquo;un qui servira à savoir où en est l&amp;rsquo;avancement du script et l&amp;rsquo;autre qui sera le script à écouter.&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Connexion à PDO MySQL</title>
      <link>lemon-cake.github.io/post/connexion-pdo-mysql/</link>
      <pubDate>Tue, 28 Jan 2014 13:00:28 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/connexion-pdo-mysql/</guid>
      <description>&lt;p&gt;PDO ou PHP Data Objects est une classe PHP permettant de se connecter à une base de donnée. Pour utiliser PDO il faut la version 5.1.0 de PHP. Afin de voir si cette extension est installée sur votre serveur, utiliser la fonction phpinfo() et recherchez la ligne PDO Driver.
&lt;div class=&#34;read-more&#34;&gt;&lt;/div&gt;&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Minimiser des scripts Javascript en PHP</title>
      <link>lemon-cake.github.io/post/minimiser-des-scripts-javascript-en-php/</link>
      <pubDate>Mon, 06 Jan 2014 14:02:42 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/minimiser-des-scripts-javascript-en-php/</guid>
      <description>&lt;p&gt;Je viens de trouver une petite classe PHP qui vous permettra de gagner du temps de chargement sur vos gros scripts Javascript.&lt;/p&gt;

&lt;p&gt;Vous avez déjà vu que lorsque vous télécharger par exemple la bibliothèque JavaScript jQuery vous avez une version *.min.js et une autre ? Et bien c&amp;rsquo;est que celle ci a été minimisé. Et bien je vais vous montrer comment minimiser vous même vos scripts JavaScript.&lt;/p&gt;

&lt;div class=&#34;read-more&#34;&gt;&lt;/div&gt;

&lt;h2&gt;Prérequis&lt;/h2&gt;

&lt;p&gt;Il vous faudra juste télécharger la classe à cette adresse : &lt;a href=&#34;https://github.com/rgrove/jsmin-php&#34;&gt;https://github.com/rgrove/jsmin-php&lt;/a&gt;&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Explorateur de fichiers</title>
      <link>lemon-cake.github.io/post/explorateur-de-fichiers/</link>
      <pubDate>Thu, 12 Dec 2013 15:07:49 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/explorateur-de-fichiers/</guid>
      <description>&lt;p&gt;Il y a quelques jours je vous parlais d&amp;rsquo;un petit plugin sympa pour parcourir un dossier et ses sous-dossiers. Le système est très pratique mais je me suis aperçu qu&amp;rsquo;il comportait une grosse faille de sécurité. En effet, il suffisait de faire une petite injection JavaScript via la console du navigateur et vous aviez accès aux dossiers que vous n&amp;rsquo;auriez jamais pu voir.&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Formulaire de contact</title>
      <link>lemon-cake.github.io/post/formulaire-de-contact/</link>
      <pubDate>Fri, 29 Nov 2013 19:42:35 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/formulaire-de-contact/</guid>
      <description>&lt;p&gt;Afin que les visiteurs de votre site puissent vous contacter, le mieux serai de mettre en place un formulaire de contact.&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Supprimer un dossier récursivement</title>
      <link>lemon-cake.github.io/post/supprimer-un-dossier-recursivement/</link>
      <pubDate>Fri, 22 Nov 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/supprimer-un-dossier-recursivement/</guid>
      <description>&lt;p&gt;&lt;p&gt;Si vous en avez assez de devoir effacer &amp;agrave; la main tout les dossiers et sous dossier sur votre FTP car la fonction &lt;a title=\&#34;http://us2.php.net/fr/rmdir\&#34; href=\&#34;http://us2.php.net/fr/rmdir\&#34; target=\&#34;_blank\&#34;&gt;rmdir();&lt;/a&gt; de php vous dit que le dossier n\&amp;lsquo;est pas vide et bien voici une petite fonction qui vous aidera :&lt;/p&gt;

&lt;p&gt;Comme vous pouvez le voir, le script est hyper simple mais cela vous fera sans doute gagner du temps&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Couper une chaîne en concervant les balises HTML</title>
      <link>lemon-cake.github.io/post/couper-une-chaine-en-concervant-les-balises-html/</link>
      <pubDate>Sat, 16 Nov 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/couper-une-chaine-en-concervant-les-balises-html/</guid>
      <description></description>
    </item>
    
    <item>
      <title>Créer un fichier zip de votre serveur et sauvegarde SQL</title>
      <link>lemon-cake.github.io/post/creer-un-fichier-zip-de-votre-serveur/</link>
      <pubDate>Fri, 11 Oct 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/creer-un-fichier-zip-de-votre-serveur/</guid>
      <description>&lt;p&gt;</description>
    </item>
    
    <item>
      <title>Temps d’exécution d&#39;un script PHP</title>
      <link>lemon-cake.github.io/post/temps-d-execution-d-un-script-php/</link>
      <pubDate>Fri, 11 Oct 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/temps-d-execution-d-un-script-php/</guid>
      <description>&lt;p&gt;&lt;p&gt;Vous avez sans doute remarqu&amp;eacute; que lorsque vous faites une recherche sur Google ou sur certains forums, il est &amp;eacute;crit : &amp;quot;Script ex&amp;eacute;cut&amp;eacute; en x secondes&amp;quot;. Et bien voici un code tr&amp;egrave;s simple qui vous permettera de voir le temps que votre script met pour s&amp;#39;ex&amp;eacute;cuter sans devoir rester &amp;agrave; cot&amp;eacute; avec un chronom&amp;egrave;tre.&lt;/p&gt;
&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>La téléportation à portée de tous</title>
      <link>lemon-cake.github.io/post/la-teleportation-a-portee-de-tous/</link>
      <pubDate>Mon, 19 Aug 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/la-teleportation-a-portee-de-tous/</guid>
      <description>&lt;p&gt;Vous avez toujours voulu vous d&amp;eacute;placer aux quatres coins du monde mais il faut payer et c&amp;#39;est souvent tr&amp;egrave;s long ? Et bien gr&amp;acirc;ce &amp;agrave; la premi&amp;egrave;re et unique application gratuite de t&amp;eacute;l&amp;eacute;portation, ce r&amp;ecirc;ve est maintenant r&amp;eacute;alit&amp;eacute; :&amp;nbsp;&lt;a href=&#34;https://play.google.com/store/apps/details?id=fr.babeuloula.teleport&#34; target=&#34;_blank&#34; title=&#34;Teleport v2&#34;&gt;https://play.google.com/store/apps/details?id=fr.babeuloula.teleport&lt;/a&gt;&lt;/p&gt;


&lt;p&gt;Bon aller fini de rigoler, cette applicaiton n&amp;#39;est qu&amp;#39;un bon gros troll, mais elle m&amp;#39;a permis de mettre en pratique les quelques heures de programmation Android que j&amp;#39;ai eu lors de ma licence pro &amp;agrave; Vichy. La premi&amp;egrave;re version &amp;agrave; &amp;eacute;t&amp;eacute; publi&amp;eacute; le 16 Janvier 2013 et ne permettait pas grand chose. Et maintenant avec la v2, j&amp;#39;ai ajout&amp;eacute; plusieurs petites choses. Je vous laisse lire le changelog :&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>Piwik, une alternative à Google Analytics</title>
      <link>lemon-cake.github.io/post/piwik-une-alternative-a-google-analytics/</link>
      <pubDate>Sun, 28 Jul 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/piwik-une-alternative-a-google-analytics/</guid>
      <description></description>
    </item>
    
    <item>
      <title>SourceTree, mergez sous Windows et Mac</title>
      <link>lemon-cake.github.io/post/sourcetree-mergez-sous-windows-et-mac/</link>
      <pubDate>Tue, 23 Jul 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/sourcetree-mergez-sous-windows-et-mac/</guid>
      <description>&lt;p&gt;&lt;a href=&#34;http://www.sourcetreeapp.com/&#34; target=&#34;_blank&#34; title=&#34;SourceTree&#34;&gt;SourceTree&lt;/a&gt; est un logiciel qui va vous permettre de merger facilement vos diff&amp;eacute;rents projets entre programmeurs. Il est totalement gratuit et est compatible Windows et Mac.&lt;/p&gt;


&lt;p&gt;Comme vous pouvez le voir sur l&amp;#39;image de t&amp;ecirc;te vous avez acc&amp;egrave;s aux diff&amp;eacute;rentes branches des projets, vous pouvez laissez des commentaires sur ces branches ...&lt;/p&gt;</description>
    </item>
    
    <item>
      <title>ConsoleBundle pour Symfony2</title>
      <link>lemon-cake.github.io/post/consolebundle-pour-symfony2/</link>
      <pubDate>Fri, 28 Jun 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/consolebundle-pour-symfony2/</guid>
      <description></description>
    </item>
    
    <item>
      <title>Couper une chaîne tous les X caractères</title>
      <link>lemon-cake.github.io/post/couper-une-chaine-tous-les-x-caracteres/</link>
      <pubDate>Tue, 11 Jun 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/couper-une-chaine-tous-les-x-caracteres/</guid>
      <description>&lt;p&gt;</description>
    </item>
    
    <item>
      <title>Codiad, la programmation dans les nuages</title>
      <link>lemon-cake.github.io/post/codiad-la-programmation-dans-les-nuages/</link>
      <pubDate>Sat, 06 Apr 2013 00:00:00 +0000</pubDate>
      
      <guid>lemon-cake.github.io/post/codiad-la-programmation-dans-les-nuages/</guid>
      <description>&lt;p&gt;En tant que programmeur vous avez d&amp;ucirc;t &amp;ecirc;tre confront&amp;eacute; &amp;agrave; ce probl&amp;egrave;me au travail, (enfin pour ma part c&amp;#39;est le cas), d&amp;#39;avoir un peu de temps libre et vouloir programmer quelque chose. Mais soit vous n&amp;#39;avez pas vous sources sur vous, soit vous un &amp;ecirc;tes un aficionado de l&amp;#39;&amp;eacute;diteur de texte libre Sublime Text et forc&amp;eacute;ment vous ne l&amp;#39;avez pas sur la machine et vous ne voulez pas programmer sous DreamWeaver ou Notepad++.&amp;nbsp;&lt;/p&gt;


&lt;p&gt;&lt;a class=&#34;zoombox zgallery1&#34; href=&#34;https://www.babeuloula.fr/mages/codiad.png&#34;&gt;&lt;img alt=&#34;L&#39;interface&#34; src=&#34;https://www.babeuloula.fr/images/codiad.png&#34; style=&#34;display:block; height:344px; margin-left:auto; margin-right:auto; width:500px&#34; /&gt;&lt;/a&gt;&lt;/p&gt;</description>
    </item>
    
  </channel>
</rss>